let texts = [
"<ruby>魔王<rt>まおう</rt></ruby>との<ruby>戦闘<rt>せんとう</rt></ruby>は楽しんでいただけましたか？",
"<ruby>SWIFT<rt>スウィフト</rt></ruby> <ruby>QUEST<rt>クエスト</rt></ruby> では、このような <ruby>RPG<rt>アールピージー</rt></ruby> 風の<ruby>戦闘<rt>せんとう</rt></ruby>を作りながらプログラミングを学びます。",
"どうしてゲームを作りながらプログラミングを学ぶのでしょうか？",
"ぼくがプログラミングをはじめたのは小学四年生のときです。",
"小学生のころ、ぼくはドラクエなどの <ruby>RPG<rt>アールピージー</rt></ruby> が<ruby>大好<rt>だいす</rt></ruby>きでした。一年生のときから<ruby>自由帳<rt>じゆうちょう</rt></ruby>の上で <ruby>RPG<rt>アールピージー</rt></ruby> を作って、友だちとサイコロをふって遊んでいました。",
"あるとき父が、いらなくなった古いコンピューターと<ruby>一冊<rt>いっさつ</rt></ruby>のプログラミングの本をくれました。プログラミングができれば、コンピューターの上で動くゲームを自分で作れると言うのです。",
"空っぽのゲームソフトがあって、自分で考えた通りにゲームを作ることができたらいいのに！そんな風に思っていたぼくにとって、プログラミングはまさに<ruby>望<rt>のぞ</rt></ruby>んでいたものでした。",
"ぼくが<ruby>最初<rt>さいしょ</rt></ruby>に作ったのは、<ruby>適当<rt>てきとう</rt></ruby>に数字を入れると HP 、 MP 、<ruby>攻撃力<rt>こうげきりょく</rt></ruby>、<ruby>防御力<rt>ぼうぎょりょく</rt></ruby>が決まり、 <ruby>RPG<rt>アールピージー</rt></ruby> 風の<ruby>戦闘<rt>せんとう</rt></ruby>ができるゲームでした。",
"<ruby>単純<rt>たんじゅん</rt></ruby>なゲームでしたが、<ruby>攻撃力<rt>こうげきりょく</rt></ruby>と<ruby>防御力<rt>ぼうぎょりょく</rt></ruby>からダメージが計算され、自分が作った通りに<ruby>戦闘<rt>せんとう</rt></ruby>がくり広げられる様子に<ruby>夢中<rt>むちゅう</rt></ruby>になりました。",
"今、世界中でプログラミングが注目されています。",
"たくさんの人たちがプログラミングの力で世界を<ruby>変<rt>か</rt></ruby>えようとしています。",
"たとえば、今話題の自動運転自動車（人間が運転しなくても自動で走る車）もプログラミングがなければ<ruby>実現<rt>じつげん</rt></ruby>できません。",
"これからは、プログラミングができる人がますます<ruby>重要<rt>じゅうよう</rt></ruby>になると考えられています。すでにたくさんの国で、学校の<ruby>授業<rt>じゅぎょう</rt></ruby>に取り入れられています。",
"日本でも近いうちに、小学校からプログラミングの<ruby>授業<rt>じゅぎょう</rt></ruby>がはじまるかもしれません。",
"しかし、「勉強」としてプログラミングをすると、おもしろくないと感じる人が多いようです。",
"プログラミングはとても楽しいものなのに、「勉強」になってしまって、みんながきらいになったらもったいないことです。",
"ぼくが小学生のころにやったのと同じように、 <ruby>RPG<rt>アールピージー</rt></ruby> を作りながら楽しくプログラミングを身につけられたら「勉強」よりいいんじゃないか。そう考えて <ruby>SWIFT<rt>スウィフト</rt></ruby> <ruby>QUEST<rt>クエスト</rt></ruby> を作りました。",
"プログラミングには<ruby>無限<rt>むげん</rt></ruby>の<ruby>可能性<rt>かのうせい</rt></ruby>があります。プログラミングを身につければ、きっとこれからの人生で役に立つと思います。",
"しかし、たとえ役に立たなくても、プログラミングはそれ自体がとても楽しいものです。",
" <ruby>SWIFT<rt>スウィフト</rt></ruby> <ruby>QUEST<rt>クエスト</rt></ruby> を通してプログラミングを<ruby>好<rt>す</rt></ruby>きになってもらえたら、作者としてはそれが一番うれしいです。",
"さあ、プログラミングをはじめましょう！"
];
let next = "about-preview.html";